/*! @file
********************************************************************************
<PRE>
模块名 : 图像特征
文件名 : ImageFeatures.cpp
相关文件 : ImageFeatures.h
文件实现功能 : 图像特征类实现
作者 : C.L.Wang
Email: morndragon@126.com
版本 : 1.0
--------------------------------------------------------------------------------
多线程安全性 : 是
异常时安全性 : 是
--------------------------------------------------------------------------------
备注 : 无
--------------------------------------------------------------------------------
修改记录 :  
日 期              版本   修改人         修改内容 
2014/03/10   1.0    C.L.Wang        创建
</PRE>
********************************************************************************

* 版权所有(c) C.L.Wang, 保留所有权利

*******************************************************************************/ 

#include "stdafx.h"

#include "ImageFeatures.h"

using namespace std;
using namespace cv;
using namespace vd;

/*! @function
********************************************************************************
<PRE>
函数名 : ImageFeatures
功能 : 默认构造函数
参数 : void
返回值 : 无
抛出异常 : 无
--------------------------------------------------------------------------------
复杂度 : 无
备注 : 无
典型用法 : ImageFeatures iIF;
--------------------------------------------------------------------------------
作者 : C.L.Wang
</PRE>
*******************************************************************************/ 
ImageFeatures::ImageFeatures (void) : 
	m_isImage(false), /*未加载图像*/
	m_isFeatures(false), /*未提取特征*/
	m_pFeatures(new std::vector<double>) /*特征向量指针*/
{
	return;
}

/*! @function
********************************************************************************
<PRE>
函数名 : ImageFeatures
功能 : 参数构造函数
参数 : const cv::Mat& _image, 图像;
返回值 : 无
抛出异常 : exception, 参数错误
--------------------------------------------------------------------------------
复杂度 : 无
备注 : 无
典型用法 : ImageFeatures iIF(image);
--------------------------------------------------------------------------------
作者 : C.L.Wang
</PRE>
*******************************************************************************/ 
ImageFeatures::ImageFeatures (const cv::Mat& _image) :
	m_image(_image), /*图像*/
	m_isFeatures(false), /*未提取特征*/
	m_pFeatures(new std::vector<double>) /*特征向量指针*/
{
	if (!m_image.data) { //测试图像
		__printLog(std::cerr, "Failed to set an image in ImageFeatures!");
		throw std::exception("Image Error! ");
	}

	m_isImage = true; //加载图像完成

	return;
}

/*! @function
********************************************************************************
<PRE>
函数名 : ~ImageFeatures
功能 : 析构函数
参数 : void
返回值 : 无
抛出异常 : 无
--------------------------------------------------------------------------------
复杂度 : 无
备注 : 无
典型用法 : iIF.~ImageFeatures();
--------------------------------------------------------------------------------
作者 : C.L.Wang
</PRE>
*******************************************************************************/ 
ImageFeatures::~ImageFeatures (void)
{
	return;
}

/*! @function
********************************************************************************
<PRE>
函数名 : loadImage
功能 : 加载图像
参数 : const cv::Mat& _image, 图像;
返回值 : void
抛出异常 : exception, 参数错误
--------------------------------------------------------------------------------
复杂度 : 无
备注 : 无
典型用法 : iIF.loadImage(image);
--------------------------------------------------------------------------------
作者 : C.L.Wang
</PRE>
*******************************************************************************/ 
void ImageFeatures::loadImage (const cv::Mat& _image)
{
	__resetData(); //重置数据

	m_image = _image; //初始化图像

	if (!m_image.data) { //测试图像
		__printLog(std::cerr, "Failed to set an image in ImageFeatures!");
		throw std::exception("Image Error! ");
	}

	m_isImage = true; //加载图像完成

	return;
}

/*! @function
********************************************************************************
<PRE>
函数名 : showImage
功能 : 显示图像
参数 : void
返回值 : void
抛出异常 : 无
--------------------------------------------------------------------------------
复杂度 : 无
备注 : 无
典型用法 : iIF.showImage();
--------------------------------------------------------------------------------
作者 : C.L.Wang
</PRE>
*******************************************************************************/ 
void ImageFeatures::showImage (void) const
{
	if (!m_isImage) { //测试图像
		__printLog(std::cerr, "Please load an image first!");
		return;
	}

	cv::imshow("Image", m_image); //显示图像
	cv::waitKey(0);

	return;
}

/*! @function
********************************************************************************
<PRE>
函数名 : getFeatures
功能 : 返回图像特征
参数 : void
返回值 : const std::shared_ptr<std::vector<double> >, 图像特征
抛出异常 : 无
--------------------------------------------------------------------------------
复杂度 : 无
备注 : 无
典型用法 :pFeatures = iIF.getFeatures();
--------------------------------------------------------------------------------
作者 : C.L.Wang
</PRE>
*******************************************************************************/ 
const std::shared_ptr<std::vector<double> > 
	ImageFeatures::getFeatures (void) const
{
	if (m_isFeatures) {
		return m_pFeatures;
	} else {
		__printLog(std::cerr, "Failed to get features!");
		return nullptr;
	}
}

/*! @function
********************************************************************************
<PRE>
函数名 : __resetData
功能 : 重置数据
参数 : void
返回值 : void 
抛出异常 : 无
--------------------------------------------------------------------------------
复杂度 : 无
备注 : 无
典型用法 : __resetData();
--------------------------------------------------------------------------------
作者 : C.L.Wang
</PRE>
*******************************************************************************/ 
void ImageFeatures::__resetData (void)
{
	if (!m_image.empty()) {
		m_image.release();
	}

	m_isImage = false;

	m_isFeatures = false;

	if (m_pFeatures != nullptr) {
		m_pFeatures->clear();
		m_pFeatures.reset(new std::vector<double>);
	}

	return;
}

/*! @function
********************************************************************************
<PRE>
函数名 : __printLog
功能 : 输出信息
参数 : 
ostream& _os, 输出格式; 
const std::string& _msg, 输出内容;
返回值 : std::ostream&;
抛出异常 : 无
--------------------------------------------------------------------------------
复杂度 : 无
备注 : 无
典型用法 : __printLog(cout, "Nothing");
--------------------------------------------------------------------------------
作者 : C.L.Wang
</PRE>
*******************************************************************************/ 
std::ostream& ImageFeatures::__printLog (
	std::ostream& _os, const std::string& _msg) const
{
	if (std::cerr == _os) {
		_os << "Warning : " << _msg << std::endl;
	} else if (std::clog == _os) {
		_os << "Log : " << _msg << std::endl;
	} else {
		_os << "Message : " << _msg << std::endl;
	}

	return _os;
}